'''
문제
화성에서는 지구와는 조금 다른 연산자 @, %, #을 사용한다. @는 3을 곱하고, %는 5를 더하며, #는 7을 빼는 연산자이다. 따라서, 화성에서는 수학 식의 가장 앞에 수가 하나 있고, 그 다음에는 연산자가 있다.

입력
첫째 줄에 테스트 케이스의 개수 T가 주어진다. 다음 줄에는 화성 수학식이 한 줄에 하나씩 주어진다. 입력으로 주어지는 수는 정수이거나 소수 첫째 자리까지 주어지며, 0 이상 100 이하이다. 연산자는 최대 3개 주어진다.

출력
각 테스트 케이스에 대해서, 화성 수학식의 결과를 계산한 다음에, 소수점 둘째 자리까지 출력한다.
'''

T = int(input())

for _ in range(T):
    a = input().split()
    num = float(a[0])
    for i in range(1, len(a)):
        if a[i]=='@':
            num = num * 3
        elif a[i]=='%':
            num = num + 5
        elif a[i]=='#':
            num = num - 7
    print('{:.2f}'.format(round(num, 2)))
